app/Controllers/Home.php

SELECT "nome_empresa"
FROM "empresas"
SELECT COUNT(*) AS "numrows"
FROM "usuarios"
WHERE "tipo_usuario" = 'CLIENTE'
SELECT COUNT(*) AS "numrows"
FROM "usuarios"
WHERE "tipo_usuario" = 'FUNCIONARIO'
SELECT COUNT(*) AS "numrows"
FROM "usuarios"
WHERE "tipo_usuario" = 'DONO_EMPRESA'
---
    public function inicio(): string
    {
        $empresaModel = new \App\Models\EmpresaModel();
        $usuarioModel = new \App\Models\UsuarioModel();

        $empresas = $empresaModel
            ->select('nome_empresa')
            ->findAll();

        $clientes = $usuarioModel
            ->where('tipo_usuario', 'CLIENTE')
            ->countAllResults();

        $funcionarios = $usuarioModel
            ->where('tipo_usuario', 'FUNCIONARIO')
            ->countAllResults();

        $donos = $usuarioModel
            ->where('tipo_usuario', 'DONO_EMPRESA')
            ->countAllResults();